---
title: HandRailType
classe: Autodesk.Revit.DB.Architecture.HandRailType
namespace: Autodesk.Revit.DB.Architecture
eredita: Autodesk.Revit.DB.Architecture.ContinuousRailType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# HandRailType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Height { get; set; }` | `handRailType.Height` | Double |
| `RailSupportJustification SupportJustification { get; set; }` | `handRailType.SupportJustification` | RailSupportJustification |
| `RailSupportsLayout SupportLayout { get; set; }` | `handRailType.SupportLayout` | RailSupportsLayout |
| `Int32 SupportNumber { get; set; }` | `handRailType.SupportNumber` | Int32 |
| `Double SupportSpacing { get; set; }` | `handRailType.SupportSpacing` | Double |
| `ElementId SupportTypeId { get; set; }` | `handRailType.SupportTypeId` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```